Revit 2027 API
AreaBasedLoadData.ConnectedPhases Property
 The electrical connected phases of the area based load to its upstream node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElectricalConnectedPhases ConnectedPhases { get; }
Public ReadOnly Property ConnectedPhases As ElectricalConnectedPhases
	Get
public:
property ElectricalConnectedPhases ConnectedPhases {
	ElectricalConnectedPhases get ();
}
member ConnectedPhases : ElectricalConnectedPhases with get
Property Value
ElectricalConnectedPhases
Remarks
 Will return a default value if no upstream node.
See Also
Reference
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace